



Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и 
минимальным элементов массива.

Задача HARD STAT необязательная: Задайте массив случайных целых чисел. Найдите 
максимальный элемент и его индекс, минимальный элемент и его индекс, среднее 
арифметическое всех элементов. Сохранить эту инфу в отдельный массив и вывести 
на экран с пояснениями. Найти медианное значение первоначалального массива , 
возможно придется кое-что для этого дополнительно выполнить.

Задача 30: - HARD необязательная Напишите программу, которая на вход получает 
размерность массива. Далее заполняет его случайными уникальными числами и выводит 
на экран. Далее производим сортировку массива от большего к меньшему и выводим на 
экран. Далее придумываем алгоритм перемешивания списка на основе случайности , 
применяем этот алгоритм и выводим на экран результат. Встроенные методы работы со 
списками использовать нельзя.
