// Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, 
// заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 
// задаются пользователем.
// b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)


// Задача 40 - HARD необязательная. На вход программы подаются три целых положительных 
// числа. Определить , является ли это сторонами треугольника. Если да, то вывести всю 
// информацию по нему - площадь, периметр, значения углов треугольника в градусах, 
// является ли он прямоугольным, равнобедренным, равносторонним.


// Задача 1 HARD необязательная. Сгенерировать массив случайных целых чисел 
// размерностью m*n (размерность вводим с клавиатуры). Вывести на экран красивенько 
// таблицей. Найти минимальное число и его индекс, найти максимальное число и его 
// индекс. Вывести эту информацию на экран.


// Задача 2 VERY HARD необязательная Имеется список чисел. Создайте список, в который 
// попадают числа, описывающие максимальную возрастающую последовательность. Порядок 
// элементов менять нельзя.
// Одно число - это не последовательность.
// Пример:
// [1, 5, 2, 3, 4, 6, 1, 7] => [1, 7]
// [1, 5, 2, 3, 4, 1, 7, 8 , 15 , 1 ] => [1, 5]
// [1, 5, 3, 4, 1, 7, 8 , 15 , 1 ] => [3, 5]


