// Задача 1 HARD необязательная. Сгенерировать массив случайных целых чисел 
// размерностью m*n (размерность вводим с клавиатуры). Вывести на экран красивенько 
// таблицей. Найти минимальное число и его индекс, найти максимальное число и его 
// индекс. Вывести эту информацию на экран.


// Задача 2 VERY HARD необязательная Имеется список чисел. Создайте список, в который 
// попадают числа, описывающие максимальную возрастающую последовательность. Порядок 
// элементов менять нельзя.
// Одно число - это не последовательность.
// Пример:
// [1, 5, 2, 3, 4, 6, 1, 7] => [1, 7]
// [1, 5, 2, 3, 4, 1, 7, 8 , 15 , 1 ] => [1, 5]
// [1, 5, 3, 4, 1, 7, 8 , 15 , 1 ] => [3, 5]

decimal x=0.6875;
decimal res=Math.Acos(x);
Console.WriteLine(res);
